---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.WallRoomSeparationOverlap
source: html/ef4cbc39-8128-9e08-0704-747af60db504.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.WallRoomSeparationOverlap Property

A wall and a room separation line overlap. One of them may be ignored when Revit finds room boundaries.
 Shorten or delete the room separation line to remove the overlap.

## Syntax (C#)
```csharp
public static FailureDefinitionId WallRoomSeparationOverlap { get; }
```